# 1. Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.

def prime_factors(n):
    sp = []
    for i in range(1, n+1):
        if n % i == 0:
            sp.append(i)
    return sp


x = input('Введите натуральное число: ')
try:
    x = int(x)
    print(prime_factors(x))
except:
    print('Введено не натуральное число!')


# 2. (необязательное). Напишите программу, которая принимает на стандартный вход список игр футбольных
# команд с результатом матча и выводит на стандартный вывод сводную таблицу результатов всех матчей.
# За победу команде начисляется 3 очка, за поражение — 0, за ничью — 1.
# Формат ввода следующий:
# В первой строке указано целое число nn — количество завершенных игр.
# После этого идет nn строк, в которых записаны результаты игры в следующем формате:
# Перваякоманда;Забитопервойкомандой;Втораякоманда;Забитовторойкомандой
# Вывод программы необходимо оформить следующим образом:
# Команда:Всегоигр Побед Ничьих Поражений Всегоочков
# Конкретный пример ввода-вывода приведён ниже.
# Порядок вывода команд произвольный.
# Sample Input:
# 3
# Спартак;9;Зенит;10
# Локомотив;12;Зенит;3
# Спартак;8;Локомотив;15
# Sample Output:
# Спартак:2 0 0 2 0
# Зенит:2 1 0 1 3
# Локомотив:2 2 0 0 6

def match_results(n):
    dict = {}
    for i in range(n):
        list = input().split(';')
        if list[0] not in dict:
            dict[list[0]] = ([0, 0, 0, 0, 0])
        if list[2] not in dict:
            dict[list[2]] = ([0, 0, 0, 0, 0])
        if int(list[1]) < int(list[3]):
            dict[list[2]][1] += 1
            dict[list[0]][3] += 1
        elif int(list[1]) > int(list[3]):
            dict[list[0]][1] += 1
            dict[list[2]][3] += 1
        elif int(list[1]) == int(list[3]):
            dict[list[0]][2] += 1
            dict[list[2]][2] += 1
    for i in dict:
        dict[i][0] = dict[i][1] + dict[i][2] + dict[i][3]
        dict[i][4] = dict[i][1]*3 + dict[i][2]
    for k, v in dict.items():
        print(f'{k}: {v[0]} {v[1]} {v[2]} {v[3]} {v[4]}')


x = input('Введите количество завершенных игр: ')

try:
    x = int(x)
    match_results(x)
except:
    print('Нужно ввести натуральное число!')
